app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "15"]]
---
  def index
    puts params.inspect
    post = Post.find(params[:id])

INSERT INTO "comments" ("comment", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["comment", {}], ["created_at", Mon, 15 Sep 2014 06:24:01 UTC +00:00], ["post_id", 1], ["updated_at", Mon, 15 Sep 2014 06:24:01 UTC +00:00]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 15
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def create
		puts params.inspect
    @comment = Comment.new()
    @comment.comment = params[:comment]
    @comment.post_id = params[:post_id]
    @comment.save
    post = Post.find(@comment.post_id)