app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
  def index
    #puts params.inspect
    #post = Post.find(params[:id])
    respond_with(@comments = Comments.all)