app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def create
    @post = Post.new(params[:post])
    @post.save
    respond_with(@posts = Post.all)